## [ 결측치 Missing Value 처리 ]
- 데이터 미입력 또는 데이터 저장 과정에서 지워진 데이터
- 빈칸 의미
- 표시 : NaN ( Not a Number) NaT (Not A Text)
- 표현 : numpy 모듈의 nan, math 모듈의 nan 사용

(1) 모듈 로딩 <hr>

In [1]:
import pandas as pd

(2) 데이터 준비 <hr>

In [2]:
file='../data/employees.csv'

(3) 데이터 저장 : CSV => DataFrame

In [3]:
# 구분자 : ,   헤더 : 첫번째 줄 컬럼명
empDF=pd.read_csv(file)

(4) 데이터 확인

In [5]:
# 데이터의 전반적인 요약정보 확인 => info() 메서드
# - 컬럼별 결측치 여부 확인 => 실제 데이터에서 결측치 체크 & 처리
# - 컬럼별 데이터 타입과 실제 데이터 타입 비교 => 타입 다른 경우, 타입 형변환 필요
empDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    object
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

In [6]:
# 해당 데이터의 분포 확인 : describe()
empDF.describe()

              Salary
count     999.000000
mean    90655.528529
std     32939.511615
min     35013.000000
25%     62560.000000
50%     90427.000000
75%    118744.500000
max    149908.000000

In [8]:
# 최빈값 => mode(), 중앙값 => median()
print(empDF.mode(numeric_only=True), 
      empDF.median(numeric_only=True),
      empDF.mean(numeric_only=True),
      sep='\n\n')

     Salary
0   86676.0
1   91462.0
2  121160.0
3  145988.0
4  147183.0

Salary    90427.0
dtype: float64

Salary    90655.528529
dtype: float64

In [9]:
empDF.info()
# Gender : 카테고리로 바꿔야 한다
# Start Date : 날짜 형태로 바꿔야 한다
# Mgmt : Bool 형태로 바꿔야 한다
# Team : 카테고리로 바꿔야 한다

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1001 entries, 0 to 1000
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  933 non-null    object
 1   Gender      854 non-null    object
 2   Start Date  999 non-null    object
 3   Salary      999 non-null    float64
 4   Mgmt        933 non-null    object
 5   Team        957 non-null    object
dtypes: float64(1), object(5)
memory usage: 47.0+ KB

- (5) 데이터 전처리(Preprocessig) => 가. 결측치 처리

- 결측치 확인 => isna(), isnull()

In [10]:
empDF.columns

Index(['First Name', 'Gender', 'Start Date', 'Salary', 'Mgmt', 'Team'], dtype='object')

In [14]:
# 전체 데이터의 컬럼별 결측치 체크
empDF.isna().head(), empDF.isnull().head()

(   First Name  Gender  Start Date  Salary   Mgmt   Team
 0       False   False       False    True  False  False
 1       False   False       False   False  False   True
 2       False   False        True   False  False  False
 3       False    True       False   False  False  False
 4       False   False       False   False  False  False,
    First Name  Gender  Start Date  Salary   Mgmt   Team
 0       False   False       False    True  False  False
 1       False   False       False   False  False   True
 2       False   False        True   False  False  False
 3       False    True       False   False  False  False
 4       False   False       False   False  False  False)

In [18]:
empDF.isna().sum(), empDF.isnull().sum() # nan값인 개수 출력

(First Name     68
 Gender        147
 Start Date      2
 Salary          2
 Mgmt           68
 Team           44
 dtype: int64,
 First Name     68
 Gender        147
 Start Date      2
 Salary          2
 Mgmt           68
 Team           44
 dtype: int64)

In [17]:
# 결측치 확인 ==> notna()/ notnull() : 결측치가 아니면 True 반환
print(empDF.notna().head(), empDF.notnull().head(), sep='\n\n')

   First Name  Gender  Start Date  Salary  Mgmt   Team
0        True    True        True   False  True   True
1        True    True        True    True  True  False
2        True    True       False    True  True   True
3        True   False        True    True  True   True
4        True    True        True    True  True   True

   First Name  Gender  Start Date  Salary  Mgmt   Team
0        True    True        True   False  True   True
1        True    True        True    True  True  False
2        True    True       False    True  True   True
3        True   False        True    True  True   True
4        True    True        True    True  True   True

In [19]:
empDF.notna().sum(), empDF.notnull().sum() # nan값이 아닌 개수 출력

(First Name    933
 Gender        854
 Start Date    999
 Salary        999
 Mgmt          933
 Team          957
 dtype: int64,
 First Name    933
 Gender        854
 Start Date    999
 Salary        999
 Mgmt          933
 Team          957
 dtype: int64)

- 결측치 처리 ==> (1) 삭제 : dropna()

In [21]:
# [설정] 모든 행에 1개의 값이라도 NaN이면 삭제
# First Name  Gender  Start Date  Salary Mgmt  Team
#     Tom       M        NA       100000 True   kTeam
empDF2=empDF.dropna()
print(empDF.shape, empDF2.shape) #삭제되고 난 행

(1001, 6) (761, 6)

In [23]:
# [설정] 모든 행에 모든 데이터 값이 NaN면 삭제
# First Name  Gender  Start Date  Salary Mgmt  Team
#     Na        NA      NA   NA     NA    NA    NA
empDF2=empDF.dropna(how='all')
print(empDF.shape, empDF2.shape) #삭제되고 난 행

(1001, 6) (1000, 6)

In [25]:
# [설정] 특정 컬럼의 NA만 체크 후 삭제하는 방법
# 예 ) 성별에 따른 연봉 분석 => NA면 분석 불가능 컬럼을 지정
empDF2=empDF.dropna(subset=["Gender","Salary"])
print(empDF.shape, empDF2.shape) #삭제되고 난 행

(1001, 6) (853, 6)

In [26]:
# [설정] 컬럼별 정상데이터(NA가 아닌 데이터) 개수 임계치 설정
# 임계치만큼의 정상데이터가 없으면 행 삭제 

empDF2=empDF.dropna(thresh=900, axis='columns') # 컬럼의 개수가 900개 이하인 것들을 지워주세요
print(empDF.shape, empDF2.shape) #삭제되고 난 행

(1001, 6) (1001, 5)

- 결측치 처리 => 대체 : fillna()

In [28]:
# Gender 컬럼에 결측값을 무엇으로 채울지???
empDF.describe(include='all')

       First Name  Gender Start Date         Salary  Mgmt Team
count         933     854        999     999.000000   933  957
unique        200       2        971            NaN     2   10
top       Marilyn  Female   10/30/04            NaN  True   IT
freq           11     431          2            NaN   468  106
mean          NaN     NaN        NaN   90655.528529   NaN  NaN
std           NaN     NaN        NaN   32939.511615   NaN  NaN
min           NaN     NaN        NaN   35013.000000   NaN  NaN
25%           NaN     NaN        NaN   62560.000000   NaN  NaN
50%           NaN     NaN        NaN   90427.000000   NaN  NaN
75%           NaN     NaN        NaN  118744.500000   NaN  NaN
max           NaN     NaN        NaN  149908.000000   NaN  NaN

In [35]:
# --> 컬럼의 최빈값으로 na 채우기
# empDF.Gender.mode()[0]
genSR = empDF.Gender.fillna(empDF.Gender.mode()[0]) # gender열의 최빈값인 M로 값 채우기
genSR.isna().sum() # nan개수가 0개임을 알 수 있다

0

In [36]:
# ==> NA 값 이전과 이후 값으로 채우기
empDF.Gender.fillna(method='ffill')

0         Male
1         Male
2       Female
3       Female
4         Male
         ...
996       Male
997       Male
998       Male
999       Male
1000      Male
Name: Gender, Length: 1001, dtype: object

In [37]:
# ==> NA 값 이전과 이후 값으로 채우기
empDF.Gender.fillna(method='ffill', limit=1)
# limit -> 기본값은 최댓값이다

0         Male
1         Male
2       Female
3       Female
4         Male
         ...
996       Male
997       Male
998       Male
999       Male
1000      Male
Name: Gender, Length: 1001, dtype: object

In [39]:
import numpy as np
df = pd.DataFrame([[np.nan, 2, np.nan, 0],
                    [3, 4, np.nan, 1],
                    [np.nan, np.nan, np.nan, np.nan],
                    [np.nan, 3, np.nan, 4]],
                   columns=list("ABCD")) # 하나씩 뜯어서 들어간다
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [41]:
df.A.fillna(method="ffill") # 위아래로 NaN값을 채운다

0    NaN
1    3.0
2    3.0
3    3.0
Name: A, dtype: float64

In [42]:
df.A.fillna(method="ffill", limit=1) # 하나만 채워졌음을 확인할 수 있다

0    NaN
1    3.0
2    3.0
3    NaN
Name: A, dtype: float64

In [46]:
df.A.fillna(method="bfill") # 하나만 채워졌음을 확인할 수 있다
df

     A    B   C    D
0  NaN  2.0 NaN  0.0
1  3.0  4.0 NaN  1.0
2  NaN  NaN NaN  NaN
3  NaN  3.0 NaN  4.0

In [47]:
df2 = pd.DataFrame(np.zeros((4, 4)), columns=list("ABCE"))
df2

     A    B    C    E
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  0.0  0.0  0.0  0.0

In [48]:
df.fillna(df2) # 결과가 이상함

     A    B    C    D
0  0.0  2.0  0.0  0.0
1  3.0  4.0  0.0  1.0
2  0.0  0.0  0.0  NaN
3  0.0  3.0  0.0  4.0

In [45]:
df.D.fillna(df.D.mean())

0    0.000000
1    1.000000
2    1.666667
3    4.000000
Name: D, dtype: float64